app/helpers/accounts_helper.rb

    def current_account
        @current_account ||= Account.find_by(id: session[:account_id])
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` IS NULL LIMIT 1