app/controllers/accounts_controller.rb

  def index
    @title = ''
    @accounts = Account.all
---
SELECT `accounts`.* FROM `accounts`

  def create
    @title = '新規登録完了'
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO `accounts` (`user_id`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('souki202', 'hoge@hogehoge.com', '$2a$10$Bp8V57MIRzcu9KaJCanHEO5qe0rEbQ6gNQkAsf0vKwez89Y.6c7hu', '2019-02-12 09:28:59', '2019-02-12 09:28:59')

    def set_account
      @account = Account.find(params[:id])
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1