app/controllers/login_controller.rb

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`account_id` = 'souki202' LIMIT 1
---
  def complete
    @title = 'ログイン'
    account = Account.find_by(account_id: params[:login][:account_id].downcase)